IBtaskR/WorkAround/XML/DataProcessors/ЗагрузкаДанныхИзExcel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаДанныхИзExcel</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

IBtaskR/WorkAround/XML/Documents/ЗаказТоваровПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗаказТоваровПоставщику</Name>
			<Comment>документ создан при помощи обработки «Загрузка данных из Excel»</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Для записи: «документ создан при помощи обработки «Загрузка данных из Excel»</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТипЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

IBtaskR/WorkAround/XML/DataProcessors/ЗагрузкаДанныхИзExcel/Forms/ФормаЗагрузкиДанныхИзЕхсе1/Ext/Form/Module.bsl
&AtServer
Procedure ПрочитатьИзВХНаСервере(АдресВХ, РасширениеИмениФайла)
	Try
		ДДанные = GetFromTempStorage(АдресВХ);
		ИмяВременногоФайла = GetTempFileName(РасширениеИмениФайла);
		ДДанные.Write(ИмяВременногоФайла);
		РеквизитТабличныйДокумент.Clear();
		РеквизитТаблицаЗначений.Clear();
		РеквизитТабличныйДокумент.Read(ИмяВременногоФайла,SpreadsheetDocumentValuesReadingMode.Value);
		DeleteFiles(ИмяВременногоФайла);
		РеквизитНижняяГраницаДокумента = РеквизитТабличныйДокумент.TableHeight;
		РеквизитСтолбецНоменклатуры = 1;
		РеквизитСтолбецСтоимости = 2;
		РеквизитВерхняяГраницаДокумента = 1;
		If РеквизитНижняяГраницаДокумента > 0 AND РеквизитТабличныйДокумент.TableWidth > 1 Then
			СтрокаТаблицы = РеквизитВерхняяГраницаДокумента;
			While СтрокаТаблицы <= РеквизитНижняяГраницаДокумента Do
				Номенклатура = РеквизитТабличныйДокумент.Area("R" + String(СтрокаТаблицы) + "C" + String(РеквизитСтолбецНоменклатуры)).Text;
				СтоимостьТекст = РеквизитТабличныйДокумент.Area("R" + String(СтрокаТаблицы) + "C" + String(РеквизитСтолбецСтоимости)).Text;
				Try
					Стоимость = Number(СтоимостьТекст);
				Except
					Стоимость = 0;
				EndTry;	
				If NOT IsBlankString(Номенклатура) AND Стоимость > 0 Then
					НоменклатураКаталога = Catalogs.Номенклатура.FindByDescription(Номенклатура);
					If  NOT НоменклатураКаталога.IsEmpty() Then
						Флаг = True;
						For Each СтрокаТЗ In РеквизитТаблицаЗначений Do
							If СтрокаТЗ.Номенклатура = НоменклатураКаталога Then
								Флаг = False;
								Break;
							EndIf;
						EndDo;
						If Флаг Then
							СтрокаТЗ = РеквизитТаблицаЗначений.Add();
							// СтрокаТЗ.Номенклатура = Номенклатура;
							СтрокаТЗ.Номенклатура = НоменклатураКаталога;
							СтрокаТЗ.Стоимость = Стоимость;
							СтрокаТЗ.Количество = 1;
						EndIf;
					EndIf;
				EndIf;
				СтрокаТаблицы = СтрокаТаблицы + 1;
        	EndDo;
		Else 
			Return;
		EndIf;
	Except
		Message(ErrorDescription());
		Return;
	EndTry;
	
	//Поток = ДДанные.OpenStreamForRead();
	//РеквизитТабличныйДокумент.Read(Поток, SpreadsheetDocumentValuesReadingMode.Text, SpreadsheetDocumentFileType.XLS);
	//Поток.Close();
EndProcedure

&AtClient
Async Procedure КомандаПрочитатьЕхселФайл(Command)
	ДиалогВыбора = New FileDialog(FileDialogMode.Open);
	ДиалогВыбора.Title = "Файл таблицы с номенклатурой и ее стоимостью";
	ДиалогВыбора.Filter = "Документ Excel (*.xls;*.xlsx)|*.xls;*.xlsx";   
	ДиалогВыбора.Preview = False;
	ДиалогВыбора.Multiselect = False;
	РезультатВыбора = Await ДиалогВыбора.ChooseAsync();
	If РезультатВыбора <> Undefined Then
		Файл = New File(ДиалогВыбора.FullFileName);
		РасширениеИмениФайла = Файл.Extension;
		ДДанные = New BinaryData(Файл.FullName);
		АдресВХ = PutToTempStorage(ДДанные);
		ПрочитатьИзВХНаСервере(АдресВХ, РасширениеИмениФайла);
	EndIf;
	
	
EndProcedure

&AtServer
Procedure СоздатьЗаказТоваровПоставщикуAtServer()
	//If NOT (РеквизитТаблицаЗначений.Count() < 1 OR РеквизитКонтрагент.IsEmpty() OR РеквизитОтветственный.IsEmpty()) Then
	If ValueIsFilled(РеквизитТаблицаЗначений) AND ValueIsFilled(РеквизитКонтрагент) AND ValueIsFilled(РеквизитОтветственный) Then
		ДокЗаказТоваровПоставщику = Documents.ЗаказТоваровПоставщику.CreateDocument();
		ДокЗаказТоваровПоставщику.Date = CurrentDate();
		ДокЗаказТоваровПоставщику.Контрагент = РеквизитКонтрагент;
		ДокЗаказТоваровПоставщику.Ответственный = РеквизитОтветственный;
		ДокЗаказТоваровПоставщику.Комментарий = "документ создан при помощи обработки «Загрузка данных из Excel»";
		For Each СтрокаТЗ In РеквизитТаблицаЗначений Do
			ДокЗаказТоваровПоставщикуТЧ = ДокЗаказТоваровПоставщику.Товары.Add();
			ДокЗаказТоваровПоставщикуТЧ.Номенклатура = СтрокаТЗ.Номенклатура;
			ДокЗаказТоваровПоставщикуТЧ.Стоимость = СтрокаТЗ.Стоимость;
			ДокЗаказТоваровПоставщикуТЧ.Количество = СтрокаТЗ.Количество;
		EndDo;
		ДокЗаказТоваровПоставщику.Write(DocumentWriteMode.Write);
		РеквизитТабличныйДокумент.Clear();
		РеквизитТаблицаЗначений.Clear();
	Else
		Message("Значения полей не заполнены");
	EndIf;		
EndProcedure

&AtClient
Procedure СоздатьЗаказТоваровПоставщику(Command)
	СоздатьЗаказТоваровПоставщикуAtServer();
EndProcedure
